import Skills_circle from "./components/skills-circles"
import TranslationsProvider from '../../../components/ts/translation-provider';
import initTranslations from "@/app/i18n";
import { FC } from "react";

const Skills: FC = async ({ params: { locale } }: any) => {

  const namespaces = ['skills_page']
  const { resources } = await initTranslations(locale, namespaces, undefined, undefined);
  // const paragraphs = [
  //   [
  //     "یادگیری ماشین",
  //     "یادگیری عمیق",
  //     "سیستم های خبره",
  //     "پردازش زبان طبیعی",
  //     "بینایی ماشین",
  //     "طراحی شبکه های عصبی",
  //     "پردازش داده",
  //     "آنالیز داده",
  //     "داده کاوی",
  //   ],
  //   [
  //     "طراحی وب سایت با جدید ترین فریم ورک های روز دنیا (Flutter, React JS, Angular, Vue, Bootstrap)",
  //     "ساخت و مدیریت وب سایت های ریسپانسیو",
  //     "طراحی و توسعه وب سایت های فروشگاهی",
  //     "طراحی و توسعه وب اپلیکیشن ها",
  //     "پنل تولید محتوا و مدیریت سایت",
  //     "طراحی و توسعه پنل کاربری",
  //     "خدمات سئو و بهینه سازی سایت",
  //     "خدمات خرید دامین و میزبانی سایت",
  //     "طراحی و توسعه وب سایت های معرفی مشاغل",
  //     "طراحی و توسعه وب سایت با قابلیت 3D"
  //   ],
  //   [
  //     "طراحی ایده",
  //     "طراحی و ساخت نرم افزارهای آموزشی",
  //     "طراحی سیستم های امنیتی مبتنی بر اندروید برای نرم افزار های مشابه موبایل بانک ها و نرم افزار های مالی (Finance)",
  //     "طراحی و ساخت بازی",
  //     "طراحی و ساخت کتاب مجازی و فروشگاه آنلاین",
  //     "یکپارچه سازی با شبکه های اجتماعی موجود (مثل اینستاگرام، بات تلگرام و ...)",
  //     "ارائه سرویس های مدیا بصورت استریمینگ (رادیو اینترنتی و ...)",
  //     "اجرای انواع تست (A/B testing, Unit testing,...)",
  //     "تعمیر و نگهداری (Maintenance)",
  //     "انتشار اپلیکیشن در مارکت پلیس های معتبر مانند کافه بازار، گوگل پلی و اپل استور",
  //     "باگ یابی حرفه ای و آنالیز موازی بعد از انتشار اپلیکیشن در استورها",
  //     "بهره گیری از معماری های روز دنیا و طراحی اپلیکیشن های مقیاس پذیر",
  //     "آموزش نیروی انسانی متخصص",
  //   ],
  //   [
  //     "تعیین منابع",
  //     "طراحی و مشاوره زیر ساخت مراکز داده",
  //     "تولید سیستم های سفارشی",
  //     "استقرار و راه اندازی تیم های توسعه سرور",
  //     "نگهداری و پشتیبانی",
  //     "معماری اطلاعات",
  //     "کلاسترینگ پایگاه داده",
  //     "لود بالانسینگ",
  //     "نصب ، کانفیگ و بهینه سازی سرورهای مجازی و اختصاصی",
  //     "هاستینگ و میزبانی",
  //     "طراحی و پیاده سازی شبکه های تحویل محتوا",
  //     "آموزش نیروی انسانی مختصص",
  //     "بازیابی داده های از دست رفته در اثر حملات امنیتی یا نفوذ",
  //   ],
  //   [
  //     "طراحی ایده",
  //     "طراحی و ساخت نرم افزارهای آموزشی",
  //     "طراحی سیستم های امنیتی مبتنی بر iOS برای نرم افزار های مشابه موبایل بانک ها و نرم افزار های مالی (Finance)",
  //     "طراحی و ساخت بازی",
  //     "طراحی و ساخت کتاب مجازی و فروشگاه آنلاین",
  //     "یکپارچه سازی با شبکه های اجتماعی موجود (مثل اینستاگرام، بات تلگرام و ...)",
  //     "ارائه سرویس های مدیا بصورت استریمینگ (رادیو اینترنتی و ...)",
  //     "اجرای انواع تست (A/B testing, Unit testing,...)",
  //     "تعمیر و نگهداری (Maintenance)",
  //     "انتشار اپلیکیشن در مارکت پلیس های معتبر مانند کافه بازار، گوگل پلی و اپل استور",
  //     "باگ یابی حرفه ای و آنالیز موازی بعد از انتشار اپلیکیشن در استورها",
  //     "بهره گیری از معماری های روز دنیا و طراحی اپلیکیشن های مقیاس پذیر",
  //     "آموزش نیروی انسانی متخصص",
  //   ],
  //   [
  //     "طراحی دیجیتال",
  //     "طراحی لوگو",
  //     "تعریف و طراحی هویت سازمانی",
  //     "طراحی تبلیغاتی",
  //     "تعریف و طراحی تجربه کاربری",
  //     "تعریف و طراحی رابط کاربری",
  //     "طراحی پوستر",
  //     "تعریف و طراحی کاراکتر",
  //     "تصویرسازی",
  //     "ساخت موشن گرافی",
  //     "ساخت انیمیشن",
  //     "طراحی 3بعدی",
  //     "عکاسی تبلیغاتی",
  //     "طراحی بسته بندی",
  //   ],
  //   [
  //     "طراحی پلان ها و سیاست ها و استراتژی امنیتی",
  //     "اعمال استراتژی فنی در پروسه های امنیتی",
  //     "مشاوره، طراحی، پیاده سازی و آموزش ISMS مبتنی بر استاندارد های ISO27001 و BS7799",
  //     "ارزیابی خطرها و آسیب پذیری ها و تهدیدات و ارائه گزارشات تحلیلی",
  //     "مشاوره، طراحی، پیاده سازی و آموزش جهت بهینه سازی و ایمن سازی سرورها",
  //     "تست نفوذ پذیری، ارزیابی وضعیت امنیت اطلاعات با استفاده شبیه سازی حملات واقعی هکرها از داخل و خارج و ارائه گزارشات جامع و دقیق",
  //     "طراحی، پیاده سازی، نگهداری، آنالیز امنیتی و پشتیبانی مراکز عملیات امنیت",
  //     "پیاده‏ سازی و مشاوره سیستم‏های امنیتی Firewall ،VPN و IPS /IDS",
  //     "بازیابی سیستم‏ها به وضعیت قبل از حمله",
  //     "مشاوره و استقرار تیم مقابله و واکنش دهنده به رخدادهای امنیتی",
  //     "طراحی مرکز مدیریت و آنالیز امنیت شبکه SOC",
  //     "راه اندازی مراکز جمع آوری یکپارچه رخداد ها و وقایع امنیتی",
  //     "طراحی زیرساخت امنیتی شبکه Server Farm ، DMZ ، WAN ، LAN و اینترنت",
  //     "طراحی سیستم های نظارتی و Auditing",
  //     "نصب و تنظیمات و Tuning تجهیزات UTM و ISP و WAF",
  //     "آزمایش و تست میزان استحکام و کاربری تجهیزات امنیتی شبکه",
  //     "ایجاد بستر های ایمن ارتباطی و راه کارهای مبتنی بر پروتکل IPsec",
  //     "ارزیابی امنیتی نرم افزار",
  //     "آموزش نیروی انسانی متخصص"
  //   ],
  // ]

  return (
    <TranslationsProvider resources={resources} locale={locale} namespaces={namespaces}>
      <Skills_circle />
    </TranslationsProvider>
  )
}
export default Skills